app/controllers/application_controller.rb

    def user
        User.find(@uid)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]