app/controllers/todos_controller.rb

    def create
     todo = user.todos.create(todo_params)
---
INSERT INTO "todos" ("title", "descrption", "status", "priority", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)